emacs.d/emacs-init.org
* Emacs Org Configuration
2014-10-25
* Description
This file is tangled using =org-babel-load-file=. What this does is generate
a =emacs-init.el= from the =emacs-lisp= source blocks.

This emacs.d is currently  designed for Emacs 24.3 and above.

**** The basic directory structure.
#+BEGIN_SRC text
  └── emacs.d
      ├── README.markdown
      ├── emacs-init.org
      ├── init.el
      ├── packages
      ├── places
      ├── snippets
      ├── backups
      ├── tempfiles
      └── themes
#+END_SRC

*** Credits:
This emacs.d was heavily inspired by the following configurations.

[[https://github.com/magnars/.emacs.d][Magnar Sveen's emacs.d]]

[[https://github.com/jhenahan/emacs.d/blob/master/emacs-init.org][Jack Henahan's init.org]]

[[https://github.com/seth/my-emacs-dot-d/blob/master/emacs-init.org][Seth Falcon's emacs-init-org]]

[[https://github.com/steckerhalter/steckemacs/blob/master/steckemacs.org][Steckerhalter's Steckemacs]]

[[https://github.com/daschwa/dotfiles][Daschwa's Dotfiles]]

* Prerequisites

** Arch Linux

*** [[https://wiki.archlinux.org/index.php/Pacaur][Pacaur (or any other AUR helepr)]]

*** [[https://github.com/cask/cask][Cask]]
#+BEGIN_SRC sh
pacaur -S cask
#+END_SRC

* Installation

** Arch Linux
*** Installing Emacs
**** 24.4 (Stable)
#+BEGIN_SRC sh
pacman -S emacs
#+END_SRC

* Package Management

[[https://github.com/rdallasgray/pallet][Pallet]] is a very helpful package management tool for Emacs.
It utilizes a dependency management platform called [[https://github.com/cask/cask][Cask]],
to update a centralized =Cask= file when you install or remove packages.

** Pallet
You can download all packages in your =Cask= file by using =M-x pallet-install=.
However, this should not be necessary.

** Cask
Cask is initialized in =init.el= with the following:
#+BEGIN_SRC emacs-lisp
(require 'cask "/usr/share/cask/cask.el")
(cask-initialize)
#+END_SRC

** Install Packages
- Install [[https://github.com/cask/cask][Cask]].
- Run =cask install= in =$HOME/.emacs.d/=.

* Packages, Modes, and Extensions
** Dependency Management with =req-package=

Where Pallet keeps track of the packages we have installed, =req-package=
handles all our internal package dependencies and configurations.

#+BEGIN_QUOTE
[[https://github.com/edvorg/req-package][req-package]] is a wrapper on top of [[https://github.com/jwiegley/use-package][use-package]], a package dependency
management tool. The documentation for =use-package= is immensely helpful for
figuring out how to describe package dependencies and settings. =req-package=
adds the =:require= keyword which allows you to define dependencies between
related packages.
#+END_QUOTE

Another nice thing about =req-package=, is that you no longer not need to
specify the =:ensure= keyword, as it is added by default.

Start using =req-package=
#+BEGIN_SRC emacs-lisp
(require 'req-package)
#+END_SRC

** Local Custom Packages
Add custom packages directory to the =load-path=.
#+BEGIN_SRC emacs-lisp
  (add-to-list 'load-path (concat user-emacs-directory "packages/"))
#+END_SRC

* Essentials
Some quick essential customizations. To tame emacs's
#+BEGIN_SRC emacs-lisp
  ;; Turn off mouse interface early in startup to avoid momentary display
  (if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
  (if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
  (if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))

  ;; Start off with some sanity.
  (req-package better-defaults)

  ;; No splash screen please
  (setq inhibit-startup-message t)

  ;; No alarms.
  (setq ring-bell-function 'ignore)

  ;; Write backup files to own directory
  (setq backup-directory-alist
        `(("." . ,(expand-file-name
                   (concat user-emacs-directory "backups")))))

  ;; Backup files correctly and clean up versions
  (setq backup-by-copying t)
  (setq delete-old-versions t)
  (setq kept-new-versions 6)
  (setq kept-old-versions 2)
  (setq version-control t)

  ;; Disable lock files
  (setq create-lockfiles nil)

  ;; Write auto-saves to own directory
  (setq auto-save-file-name-transforms
        `((".*" ,(expand-file-name
                  (concat user-emacs-directory "tempfiles")) t)))


  ;; Make backups of files, even when they're in version control
  (setq vc-make-backup-files t)

  ;; Save point position between sessions
  (req-package saveplace)
  (setq-default save-place t)
  (setq save-place-file (expand-file-name "places" user-emacs-directory))

  ;; Fix empty pasteboard error
  (setq save-interprogram-paste-before-kill nil)

  ;; Enable some commands
  (put 'downcase-region 'disabled nil)
  (put 'upcase-region 'disabled nil)
  (put 'narrow-to-region 'disabled nil)
  (put 'erase-buffer 'disabled nil)

  ;; Allow pasting selection outside Emacs
  (setq x-select-enable-clipboard t)

  ;; Move deleted fiels to trash
  (setq delete-by-moving-to-trash t)

  ;; No shift marking/selecting
  (setq shift-select-mode nil)

  ;; Answer yes/no with y/n
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; Set coding system to utf-8 everywhere
  (setq locale-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)

  ;; Use spaces by defult
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 2)

  ;; Line and column numbers
  (setq line-number-mode t)
  (setq column-number-mode t)
#+END_SRC

* Keybindings
#+BEGIN_QUOTE
There are a number of ways to bind keys in Emacs, but I find
=bind-key=, bundled with =use-package=, easier to work with and,
more importantly, easier to read. =bind-key= takes a key sequence, a
command, and an optional keymap.  =bind-key*= overrides any minor
mode which sets the keybinding. =unbind-key= takes a key sequence
and a keymap and removes that binding. Invoking
=describe-personal-keybindings= prints a summary of your keybindings
through =bind-key= and any overrides or conflicts. This is really
the killer convenience of using =bind-key=.
#+END_QUOTE

** Exiting
I don't like to quit Emacs on accident, and I find closing frames are more useful.

#+BEGIN_SRC emacs-lisp
  ;; The mnemonic is C-x REALLY QUIT
  (bind-key "C-x r q" 'save-buffers-kill-terminal)
  (bind-key "C-x C-c" 'delete-frame)
#+END_SRC

** Improvements
#+BEGIN_SRC emacs-lisp
  ;; Home and End Keys:
  (bind-key "<home>" 'move-beginning-of-line)
  (bind-key "<end>" 'move-end-of-line)

  ;; Joins Lines into one
  (bind-key  "M-j" '(lambda () (interactive) (join-line -1)))

  ;; Kill line from the left
  (bind-key "<s-backspace>" '(lambda () (interactive) (kill-line 0)))

  ;; Quickly jump to last change
  (bind-key "C-x C-\\" 'goto-last-change)

  ;; Clean up whitespace
  (bind-key "C-c @ c" 'delete-trailing-whitespace)

  ;; Replace string
  (bind-key "C-c r" 'replace-string)
#+END_SRC

** Unbind keys
Sometimes there are system keybindings that get in the way and will be used later.

#+BEGIN_SRC emacs-lisp
(dolist (keys '("<M-up>" "<M-down>" "<s-left>" "<s-right>"
                "s-c" "s-v" "s-x" "s-v" "s-q" "s-s" "s-w"
                "s-a" "s-o" "s-n" "s-p" "s-k" "s-u" "s-m"
                "s-f" "s-z" "s-g" "s-d" "s-," "s-:" "s-e"
                "s-t" "C-z"))
  (global-unset-key (kbd keys)))
#+END_SRC

* TODO Appearance
** Font
I default to DejaVu Sans Mono for everything.
#+BEGIN_SRC emacs-lisp
   (set-face-attribute 'default nil :family "DejaVu Sans Mono" :height 98)
#+END_SRC

** Theme
Set custom theme path and load theme
#+BEGIN_SRC emacs-lisp
(setq custom-theme-directory (concat user-emacs-directory "themes/"))

(load-theme 'smyx-custom t)
#+END_SRC

** Pretty Mode
#+BEGIN_SRC emacs-lisp
  (req-package pretty-mode
    :config
    (global-pretty-mode 1))
#+END_SRC

** TODO Mode Line
*** Date
Display the date on the mode line.
#+BEGIN_SRC emacs-lisp
(setq display-time-day-and-date t
                display-time-format "%a %b %d %R"
                display-time-interval 60
                display-time-default-load-average nil)
             (display-time)
#+END_SRC

*** TODO Use a custom powerline theme that includes workgroup and evil support
#+BEGIN_SRC emacs-lisp
  (req-package powerline
               :config
               (powerline-default-theme))
#+END_SRC

** Custom Keywords

*** Keyword Symbols
#+BEGIN_SRC emacs-lisp
(defun add-operator-hl ()
  (font-lock-add-keywords
   nil
   '(("\s[-]\s\\|\s[/]\s\\|[%]\\|[+]\\|[*]\\|[!=]\\|[/=]\\|[<=]\\|[>=]" . font-lock-keyword-face))))
;; prog-mode applies to all programming modes
(add-hook 'prog-mode-hook 'add-operator-hl)
#+END_SRC

** Other
Don't defer screen updates when performing operations
#+BEGIN_SRC emacs-lisp
(setq redisplay-dont-pause t)
#+END_SRC

* Custom Functions
** Lisp
*** Evaluate and Replace
#+BEGIN_SRC emacs-lisp
(defun eval-and-replace ()
  "Replace the preceding sexp with its value."
  (interactive)
  (backward-kill-sexp)
  (condition-case nil
      (prin1 (eval (read (current-kill 0)))
             (current-buffer))
    (error (message "Invalid expression")
           (insert (current-kill 0)))))
(bind-key "C-x x e" 'eval-and-replace)
#+END_SRC

** Buffer
*** Kill Region / Line
With these in place, you can kill or copy the line point is on with a single keystroke:

- =C-w= kills the current line
- =M-w= copies the current line

Note that if there is an active region, =kill-region= and =kill-ring-save=
will continue to do what they normally do: Kill or copy it.
#+BEGIN_SRC emacs-lisp
  (defadvice kill-region (before slick-cut activate compile)
    "When called interactively with no active region, kill a single
  line instead."
    (interactive
     (if mark-active
         (list (region-beginning) (region-end))
       (list (line-beginning-position) (line-beginning-position 2)))))

  (defadvice kill-ring-save (before slick-copy activate compile)
    "When called interactively with no active region, copy a single
  line instead."
    (interactive
     (if mark-active
         (list (region-beginning) (region-end))
       (message "Copied line")
       (list (line-beginning-position) (line-beginning-position 2)))))
#+END_SRC
Borrowed from [[http://emacs.stackexchange.com/questions/2347/kill-or-copy-current-line-with-minimal-keystrokes][this]] emacs.stackexchange question.

