emacs.d/emacs-init.el

(require 'cask "/usr/share/cask/cask.el")
(cask-initialize)

(require 'req-package)

(add-to-list 'load-path (concat user-emacs-directory "packages/"))

;; Turn off mouse interface early in startup to avoid momentary display
(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))

;; Start off with some sanity.
(req-package better-defaults)

;; No splash screen please
(setq inhibit-startup-message t)

;; No alarms.
(setq ring-bell-function 'ignore)

;; Write backup files to own directory
(setq backup-directory-alist
      `(("." . ,(expand-file-name
                 (concat user-emacs-directory "backups")))))

;; Backup files correctly and clean up versions
(setq backup-by-copying t)
(setq delete-old-versions t)
(setq kept-new-versions 6)
(setq kept-old-versions 2)
(setq version-control t)

;; Disable lock files
(setq create-lockfiles nil)

;; Write auto-saves to own directory
(setq auto-save-file-name-transforms
      `((".*" ,(expand-file-name
                (concat user-emacs-directory "tempfiles")) t)))


;; Make backups of files, even when they're in version control
(setq vc-make-backup-files t)

;; Save point position between sessions
(req-package saveplace)
(setq-default save-place t)
(setq save-place-file (expand-file-name "places" user-emacs-directory))

;; Fix empty pasteboard error
(setq save-interprogram-paste-before-kill nil)

;; Enable some commands
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'erase-buffer 'disabled nil)

;; Allow pasting selection outside Emacs
(setq x-select-enable-clipboard t)

;; Move deleted fiels to trash
(setq delete-by-moving-to-trash t)

;; No shift marking/selecting
(setq shift-select-mode nil)

;; Answer yes/no with y/n
(defalias 'yes-or-no-p 'y-or-n-p)

;; Set coding system to utf-8 everywhere
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

;; Use spaces by defult
(setq-default indent-tabs-mode nil)
(setq-default tab-width 2)

;; Line and column numbers
(setq line-number-mode t)
(setq column-number-mode t)

;; The mnemonic is C-x REALLY QUIT
(bind-key "C-x r q" 'save-buffers-kill-terminal)
(bind-key "C-x C-c" 'delete-frame)

;; Home and End Keys:
(bind-key "<home>" 'move-beginning-of-line)
(bind-key "<end>" 'move-end-of-line)

;; Joins Lines into one
(bind-key  "M-j" '(lambda () (interactive) (join-line -1)))

;; Kill line from the left
(bind-key "<s-backspace>" '(lambda () (interactive) (kill-line 0)))

;; Quickly jump to last change
(bind-key "C-x C-\\" 'goto-last-change)

;; Clean up whitespace
(bind-key "C-c @ c" 'delete-trailing-whitespace)

;; Replace string
(bind-key "C-c r" 'replace-string)

(dolist (keys '("<M-up>" "<M-down>" "<s-left>" "<s-right>"
                "s-c" "s-v" "s-x" "s-v" "s-q" "s-s" "s-w"
                "s-a" "s-o" "s-n" "s-p" "s-k" "s-u" "s-m"
                "s-f" "s-z" "s-g" "s-d" "s-," "s-:" "s-e"
                "s-t" "C-z"))
  (global-unset-key (kbd keys)))

(set-face-attribute 'default nil :family "DejaVu Sans Mono" :height 98)

(setq custom-theme-directory (concat user-emacs-directory "themes/"))

(load-theme 'smyx-custom t)

(req-package pretty-mode
  :config
  (global-pretty-mode 1))

(setq display-time-day-and-date t
                display-time-format "%a %b %d %R"
                display-time-interval 60
                display-time-default-load-average nil)
             (display-time)

(req-package powerline
             :config
             (powerline-default-theme))

(defun add-operator-hl ()
  (font-lock-add-keywords
   nil
   '(("\s[-]\s\\|\s[/]\s\\|[%]\\|[+]\\|[*]\\|[!=]\\|[/=]\\|[<=]\\|[>=]" . font-lock-keyword-face))))
;; prog-mode applies to all programming modes
(add-hook 'prog-mode-hook 'add-operator-hl)

(setq redisplay-dont-pause t)

(defun eval-and-replace ()
  "Replace the preceding sexp with its value."
  (interactive)
  (backward-kill-sexp)
  (condition-case nil
      (prin1 (eval (read (current-kill 0)))
             (current-buffer))
    (error (message "Invalid expression")
           (insert (current-kill 0)))))
(bind-key "C-x x e" 'eval-and-replace)

(defadvice kill-region (before slick-cut activate compile)
  "When called interactively with no active region, kill a single
line instead."
  (interactive
   (if mark-active
       (list (region-beginning) (region-end))
     (list (line-beginning-position) (line-beginning-position 2)))))

(defadvice kill-ring-save (before slick-copy activate compile)
  "When called interactively with no active region, copy a single
line instead."
  (interactive
   (if mark-active
       (list (region-beginning) (region-end))
     (message "Copied line")
     (list (line-beginning-position) (line-beginning-position 2)))))
