emacs.d/emacs-init.org
*** Built in Games
=M-x <game>= to play.
- Snake: Eat the red squares.
- Tetris: Arrange falling blocks.
- Pong: Two-Player ping-pong.
- Zone: Manipulates the text in your buffer when Emacs is idle.
- Life: Watch a Conway's Game of Life simulation.
- Morse Code: Transate a region into dots and dashes.
- 2048: Merge teh tiles to reach 2048

* Server
** Client/Server
Running emacs as greatly improves startup
#+BEGIN_SRC emacs-lisp
  (req-package server
               :config
               (unless (server-running-p)
                 (server-start)))
#+END_SRC

** Edit With Emacs
[[https://chrome.google.com/webstore/detail/edit-with-emacs/ljobjlafonikaiipfkggjbhkghgicgoh?hl=en][Edit With Emacs]] provides a method to use an edit server for text fields in the browser.
#+BEGIN_SRC emacs-lisp
  (req-package edit-server
               :config
               (when (daemonp)
                 (edit-server-start)))
#+END_SRC

* Finish Requirements
All done with  =req-package=.
#+BEGIN_SRC emacs-lisp
(req-package-finish)
#+END_SRC

