emacs.d/emacs-init.el

(req-package server
             :config
             (unless (server-running-p)
               (server-start)))

(req-package edit-server
             :config
             (when (daemonp)
               (edit-server-start)))

(req-package-finish)
